# 1. Создать список и заполнить его элементами различных типов данных.
# 2. Реализовать скрипт проверки типа данных каждого элемента.
# 3. Использовать функцию type() для проверки типа.
# 4. Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

new_list = ['Brain', 8954, 'Geek']
new_list.append(True)
new_list.insert(3, 'Cherry pie')
print(new_list)
print(type(new_list[0]))
print(type(new_list[1]))
print(type(new_list[2]))
print(type(new_list[3]))
print(type(new_list[4]))


